Autodesk.Navisworks.Api.Plugins.FileProtocolPlugin
A plugin for implementing a custom file protocol.

Autodesk.Navisworks.Api.Plugins.FileProtocolPlugin.#ctor
Default constructor.

Autodesk.Navisworks.Api.Plugins.FileProtocolPlugin.GetFile(System.Uri,System.String,Autodesk.Navisworks.Api.Progress)
Downloads a remote URI to a local path.

Autodesk.Navisworks.Api.Plugins.FileProtocolPlugin.GetFileInfo(System.Uri,Autodesk.Navisworks.Api.Plugins.FileMetadata)
Returns information about a URI.

Autodesk.Navisworks.Api.Plugins.FileProtocolPlugin.GetFileToCache(System.Uri,Autodesk.Navisworks.Api.Progress,System.String@)
Downloads a remote URI to the protocols internal cache.

Autodesk.Navisworks.Api.Plugins.FileProtocolPlugin.IsRemote
Does this protocol access remote data?

Autodesk.Navisworks.Api.Plugins.FileProtocolPlugin.OpenFile(System.Uri,Autodesk.Navisworks.Api.Plugins.FileProtocolOpenMode)
Directly opens a URI.

Autodesk.Navisworks.Api.Plugins.FileProtocolPlugin.PutFile(System.String,System.Uri,Autodesk.Navisworks.Api.Progress)
Uploads a file to a remote URI.

Autodesk.Navisworks.Api.Plugins.FileProtocolPlugin.SupportedSchemes
List of schemes that this protocol supports.

Autodesk.Navisworks.Api.Plugins.FileProtocolPlugin.SupportsDirectOpen
Does this protocol support direct opening of a file?

Autodesk.Navisworks.Api.Plugins.FileProtocolPlugin.SupportsGetPut
Does this protocol support the GetFile and PutFile methods?

Autodesk.Navisworks.Api.Plugins.FileProtocolPlugin.SupportsOwnCache
Does this protocol support it's own cache?

Autodesk.Navisworks.Api.Plugins.FileProtocolPlugin.TryGetDisplayName(System.Uri,System.String@)
Returns the normal display name for a given URI.

Autodesk.Navisworks.Api.Plugins.FileProtocolPlugin.TryGetMRUPath(System.Uri,System.String@)
Returns the path to store in the MRU list for a given URI.

Autodesk.Navisworks.Api.Plugins.FileProtocolPlugin.TryGetPhysicalPath(System.Uri,System.String@)
Returns the verbose display name for a given URI.

Autodesk.Navisworks.Api.Plugins.FileProtocolPlugin.TryGetVerboseDisplayName(System.Uri,System.String@)
Returns the verbose display name for a given URI.

Autodesk.Navisworks.Api.Plugins.FileProtocolPlugin.TryResolveAbsolute(System.String,System.String,System.String,System.String@)
Called to resolve an absolute URI.

Autodesk.Navisworks.Api.Plugins.FileProtocolPlugin.TryResolveRelative(System.String,System.String,System.String@)
Called to resolve an relative URI.